// Імпортуємо бібліотеку yup для валідації форм
import * as yup from "yup";

// Створюємо схему валідації для форми за допомогою yup
export const validationSchema = yup.object({
  // Валідація для поля "name" (ім'я)
  name: yup
    .string()  // Перевіряємо, чи є значення рядком
    .required("Ім'я є обов'язковим")  // Перевіряємо, чи значення не порожнє
    .min(3, "Мінімум 3 символи"),  // Перевіряємо, чи довжина мінімум 3 символи

  // Валідація для поля "email" (електронна пошта)
  email: yup
    .string()  // Перевіряємо, чи є значення рядком
    .required("Email є обов'язковим")  // Перевіряємо, чи значення не порожнє
    .email("Некоректний формат email"),  // Перевіряємо, чи є це дійсним email

  // Валідація для поля "age" (вік)
  age: yup
    .number()  // Перевіряємо, чи є значення числом
    .required("Вік є обов'язковим")  // Перевіряємо, чи значення не порожнє
    .positive("Вік має бути додатнім числом")  // Перевіряємо, чи число додатнє
    .integer("Вік має бути цілим числом"),  // Перевіряємо, чи число ціле

  // Валідація для поля "website" (посилання)
  website: yup
    .string()  // Перевіряємо, чи є значення рядком
    .url("Некоректний URL-адрес")  // Перевіряємо, чи є це дійсним URL
    .required("Посилання є обов'язковим")  // Перевіряємо, чи значення не порожнє
    .matches(
      /^(https?:\/\/)?(www\.)?kickstarter\.com\/start/,  // Перевіряємо, чи відповідає формат URL для Kickstarter
      "URL має бути посиланням на Kickstarter"  // Повідомлення при невідповідності формату
    ),
});
